W07D2/music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "email@email.com"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, pw)
    user = User.find_by(email: email)