W08D1/reddit_clone/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.base64(64)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "XXQPL9TVQHTVMXgMKf817VRFhtZALM7Bvp+NLfowEb6Lj/SwcSEeVOEtWU7dKnlgp6lbYEx8zn60EU2YgC2yEg=="], ["updated_at", "2021-01-11 22:48:35.000730"], ["id", 1]]