W07D2/music_app/app/controllers/users_controller.rb

  def show
    #debugger
    user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create

    user = User.new(user_params)
    if user.save!
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy      #extra - if "delete my account " button
    user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]