W08D1/reddit_clone/app/controllers/posts_controller.rb

    def create
        #debugger
        @post = Post.new(post_params)
        @subs = Sub.all
        @post.author_id = current_user.id
        if @post.save
---
SELECT "subs".* FROM "subs"
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"